Revit 2027 API
IFCOpeningData.GetOpeningSolids Method
 Gets opening solids.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Solid> GetOpeningSolids()
Public Function GetOpeningSolids As IList(Of Solid)
public:
IList<Solid^>^ GetOpeningSolids()
member GetOpeningSolids : unit -> IList<Solid>
Return Value
IList<Solid>
 The solids.
See Also
Reference
IFCOpeningData Class
Autodesk.Revit.DB.IFC Namespace